---
kind: property
id: P:Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.IsDataPanelSchedule
source: html/065e52f3-c115-160a-c681-51e5a78e956b.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.IsDataPanelSchedule Property

Checks to see if this object is data panel schedule template element.

## Syntax (C#)
```csharp
public bool IsDataPanelSchedule { get; }
```